# DebugtabDataboundcontrolsdemoBoolean Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DebugtabDataboundcontrolsdemoBoolean Property
ParameterTypeId Class See Also
---
"Boolean"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DebugtabDataboundcontrolsdemoBoolean { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DebugtabDataboundcontrolsdemoBoolean As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DebugtabDataboundcontrolsdemoBoolean {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace